/* package up error # */
"error %1$d" = "Fehler %1$d";
"error %1$#x" = "Fehler %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Unbekannter Fehler: 0";

/* errno error 1 */
"Operation not permitted" = "Der Vorgang ist nicht zugelassen";

/* errno error 2 */
"No such file or directory" = "Es existiert keine Datei und kein Ordner dieser Art";

/* errno error 3 */
"No such process" = "Kein Prozess dieser Art";

/* errno error 4 */
"Interrupted system call" = "Systemaufruf wurde unterbrochen";

/* errno error 5 */
"Input/output error" = "Eingabe-/Ausgabe-Fehler";

/* errno error 6 */
"Device not configured" = "Gerät wurde nicht konfiguriert";

/* errno error 7 */
"Argument list too long" = "Argumentliste ist zu lang";

/* errno error 8 */
"Exec format error" = "Formatfehler des startfähigen Programms";

/* errno error 9 */
"Bad file descriptor" = "Ungültige Dateibeschreibung";

/* errno error 10 */
"No child processes" = "Keine untergeordneten Prozesse";

/* errno error 11 */
"Resource deadlock avoided" = "Eine Blockierung der Ressource wurde vermieden";

/* errno error 12 */
"Cannot allocate memory" = "Speicher kann nicht zugewiesen werden";

/* errno error 13 */
"Permission denied" = "Zugriff verweigert";

/* errno error 14 */
"Bad address" = "Ungültige Adresse";

/* errno error 15 */
"Block device required" = "Block-Gerät ist erforderlich";

/* errno error 16 */
"Resource busy" = "Ressource ist belegt";

/* errno error 17 */
"File exists" = "Datei existiert";

/* errno error 18 */
"Cross-device link" = "Geräte-übergreifender Link";

/* errno error 19 */
"Operation not supported by device" = "Der Vorgang wird von dem Gerät nicht unterstützt";

/* errno error 20 */
"Not a directory" = "Kein Ordner";

/* errno error 21 */
"Is a directory" = "Ist ein Ordner";

/* errno error 22 */
"Invalid argument" = "Ungültiges Argument";

/* errno error 23 */
"Too many open files in system" = "Zu viele offene Dateien im System";

/* errno error 24 */
"Too many open files" = "Zu viele offene Dateien";

/* errno error 25 */
"Inappropriate ioctl for device" = "Ungültiger „ioctl“ für das Gerät";

/* errno error 26 */
"Text file busy" = "Textdatei ist in Verwendung";

/* errno error 27 */
"File too large" = "Die Datei ist zu groß";

/* errno error 28 */
"No space left on device" = "Auf dem Gerät ist kein Platz verfügbar";

/* errno error 29 */
"Illegal seek" = "Illegale Suche";

/* errno error 30 */
"Read-only file system" = "Dateisystem ist schreibgeschützt";

/* errno error 31 */
"Too many links" = "Zu viele Links";

/* errno error 32 */
"Broken pipe" = "Defekte Pipe";

/* errno error 33 */
"Numerical argument out of domain" = "Numerisches Argument außerhalb der Domain";

/* errno error 34 */
"Result too large" = "Das Ergebnis ist zu groß";

/* errno error 35 */
"Resource temporarily unavailable" = "Die Ressource ist zeitweilig nicht verfügbar";

/* errno error 36 */
"Operation now in progress" = "Der Vorgang ist jetzt in Arbeit";

/* errno error 37 */
"Operation already in progress" = "Vorgang ist bereits in Arbeit";

/* errno error 38 */
"Socket operation on non-socket" = "Socket-Vorgang in Nicht-Socket";

/* errno error 39 */
"Destination address required" = "Die Zieladresse wird benötigt";

/* errno error 40 */
"Message too long" = "Die Nachricht ist zu lang";

/* errno error 41 */
"Protocol wrong type for socket" = "Ungültiger Protokolltyp für Socket";

/* errno error 42 */
"Protocol not available" = "Das Protokoll ist nicht verfügbar";

/* errno error 43 */
"Protocol not supported" = "Das Protokoll wird nicht unterstützt";

/* errno error 44 */
"Socket type not supported" = "Der Socket-Typ wird nicht unterstützt";

/* errno error 45 */
"Operation not supported" = "Der Vorgang wird nicht unterstützt";

/* errno error 46 */
"Protocol family not supported" = "Die Protokollfamilie wird nicht unterstützt";

/* errno error 47 */
"Address family not supported by protocol family" = "Die Adressfamilie wird von der Protokollfamilie nicht unterstützt";

/* errno error 48 */
"Address already in use" = "Adresse wird bereits verwendet";

/* errno error 49 */
"Can't assign requested address" = "Die gewünschte Adresse kann nicht zugeordnet werden";

/* errno error 50 */
"Network is down" = "Das Netzwerk ist inaktiv";

/* errno error 51 */
"Network is unreachable" = "Das Netzwerk kann nicht erreicht werden";

/* errno error 52 */
"Network dropped connection on reset" = "Das Netzwerk hat die Verbindung zurückgesetzt";

/* errno error 53 */
"Software caused connection abort" = "Die Software hat einen Verbindungsabbruch verursacht";

/* errno error 54 */
"Connection reset by peer" = "Verbindung wurde von der Gegenstelle zurückgesetzt";

/* errno error 55 */
"No buffer space available" = "Es ist kein Pufferplatz verfügbar";

/* errno error 56 */
"Socket is already connected" = "Socket ist bereits verbunden";

/* errno error 57 */
"Socket is not connected" = "Socket ist nicht verbunden";

/* errno error 58 */
"Can't send after socket shutdown" = "Nach Deaktivieren des Sockets kann nicht mehr gesendet werden";

/* errno error 59 */
"Too many references: can't splice" = "Zu viele Verweise: Verknüpfen nicht möglich";

/* errno error 60 */
"Operation timed out" = "Der Vorgang hat das Zeitlimit überschritten";

/* errno error 61 */
"Connection refused" = "Die Verbindung wurde abgewiesen";

/* errno error 62 */
"Too many levels of symbolic links" = "Zu viele Ebenen von symbolischen Links";

/* errno error 63 */
"File name too long" = "Der Dateiname ist zu lang";

/* errno error 64 */
"Host is down" = "Host ist deaktiviert";

/* errno error 65 */
"No route to host" = "Keine Route zum Host";

/* errno error 66 */
"Directory not empty" = "Ordner nicht leer";

/* errno error 67 */
"Too many processes" = "Zu viele Prozesse";

/* errno error 68 */
"Too many users" = "Zu viele Benutzer";

/* errno error 69 */
"Disc quota exceeded" = "Volume-Kontingent überschritten";

/* errno error 70 */
"Stale NFS file handle" = "Abgelaufene NFS-Dateiverknüpfung";

/* errno error 71 */
"Too many levels of remote in path" = "Zu viele entfernte Ebenen im Pfad";

/* errno error 72 */
"RPC struct is bad" = "RPC-Struktur ist ungültig";

/* errno error 73 */
"RPC version wrong" = "RPC-Version ist ungültig";

/* errno error 74 */
"RPC prog. not avail" = "RPC-Programm ist nicht verfügbar";

/* errno error 75 */
"Program version wrong" = "Ungültige Programmversion";

/* errno error 76 */
"Bad procedure for program" = "Ungültiger Vorgang für das Programm";

/* errno error 77 */
"No locks available" = "No locks available";

/* errno error 78 */
"Function not implemented" = "Funktion nicht implementiert";

/* errno error 79 */
"Inappropriate file type or format" = "Dateityp oder -format ungültig";

/* errno error 80 */
"Authentication error" = "Identifizierungsfehler";

/* errno error 81 */
"Need authenticator" = "Identifizierung wird benötigt";

/* errno error 82 */
"Device power is off" = "Gerät ist nicht eingeschaltet";

/* errno error 83 */
"Device error" = "Gerätefehler";

/* errno error 84 */
"Value too large to be stored in data type" = "Der Wert ist zu groß und kann im Datentyp nicht gesichert werden";

/* errno error 85 */
"Bad executable (or shared library)" = "Startfähiges Programm (oder Gemeinschaftsbibliothek) ungültig";

/* errno error 86 */
"Bad CPU type in executable" = "Ungültiger CPU-Typ im startfähigen Programm";

/* errno error 87 */
"Shared library version mismatch" = "Die Version der Gemeinschaftsbibliothek stimmt nicht überein";

/* errno error 88 */
"Malformed Mach-o file" = "Defekte Mach-O-Datei";

/* errno error 89 */
"Operation canceled" = "Vorgang abgebrochen";

/* errno error 90 */
"Identifier removed" = "Identifier wurde entfernt";

/* errno error 91 */
"No message of desired type" = "Keine Nachricht gewünschten Typs";

/* errno error 92 */
"Illegal byte sequence" = "Ungültige Byte-Sequenz";

/* errno error 93 */
"Attribute not found" = "Das Attribut wurde nicht gefunden";

/* errno error 94 */
"Bad message" = "Ungültige Nachricht";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (Reserviert)";

/* errno error 96 */
"No message available on STREAM" = "Keine Nachricht verfügbar im STREAM";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (Reserviert)";

/* errno error 98 */
"No STREAM resources" = "Keine STREAM-Ressourcen";

/* errno error 99 */
"Not a STREAM" = "Kein STREAM";

/* errno error 100 */
"Protocol error" = "Protokollfehler";

/* errno error 101 */
"STREAM ioctl timeout" = "STREAM-ioctl Zeitüberschreitung";

/* errno error 102 */
"Operation not supported on socket" = "Der Vorgang wird vom Socket nicht unterstützt.";

/* errno error 103 */
"Policy not found" = "Richtlinie nicht gefunden";
